

Page({
  data: {
    loglist:[
        `<h1 class="h1 red mb10">更新内容 v1.4.3.20230509</h1>
        <p>1、修正重置操作没有对高招S和高招A忍者碎片数量清零的bug</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.4.2.20230506</h1>
        <p>1、调整远程数据获取逻辑，便于基础数据更新</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.4.1.20230427</h1>
        <p>1、新增可选忍者：2023年5月高招S忍 漩涡鸣人[九喇嘛连结]</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.4.1.20230224</h1>
        <p>1、新增可选忍者：2023年3月高招A忍 艾[青年]</p>
        <p>2、修复统计面板收起状态下，忍者碎片名称过长显示的问题</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.4.0.20221216</h1>
        <p>1、新增可选忍者：2023年1月高招S忍 迈特凯[死门]</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.4.0.20221022</h1>
        <p>1、新增可选忍者：2022年11月高招A忍 达鲁伊[博人传]</p>
        <p>2、新增体验版100连抽，受机能限制可能存在卡顿现象，体验不佳，未来视情况优化此功能；</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.3.0.20220922</h1>
        <p>1、新增音量调节功能</p>
        <p>2、服务器资源维护；</p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.2.1.20220830</h1>
        <p>1、调整了一些表现爆率异常的问题；</p>`,
        `<h1 class="h1 red mb10">更新内容 v1.2.0.20220828</h1>
        <p>1、增加忍者配置功能，新增宇智波带土[忍界大战]；</p>
        <p>2、概率校正，7.5%概率出现S碎片，17.5%概率出现A碎片；</p>
        <p>3、优化部分情况下连续点击返利礼包多次领取问题；</p>
        <p>4、优化toast提示文字显示中断问题；</p>
        <p>5、增加目标忍者碎片返利礼包获得数量独立显示；</p>
        <p>6、新增界面标题；</p>
        <p></p>
        <p></p>`,
        `<h1 class="h1 red mb10">更新内容 v1.2.0.20220825</h1>
        <p>1、增加忍者配置功能；</p>
        <p>2、优化代码；</p>`,
        `<h1 class="h1 red mb10">更新内容 v1.1.1.20220818</h1>
        <p>1、修复重置操作偶现忍者碎片数量和返利礼包状态未重置的错误；</p>
        <p>2、优化代码执行效率；</p>`,
        `<h1 class="h1 red mb10">更新内容 v1.0.0.20220803</h1>
        <p>1、增加了高招返利（首付）领取界面;</p>
        <p>2、增加V等级的设置，影响首付领取的碎片数量；</p>
        <p>3、设置弹窗功能整合；</p>
        <p>4、增加吐槽模块；</p>
        <p>5、优化了数据统计的UI界面视觉效果;</p>`,
        `<h1 class="h1 red mb10">更新内容 v1.1.0beta</h1>
        <p>1、提升小程序打开速度。</p>
        <p>2、取消字体包自动加载，改为手动设置项。</p>
        <p>3、增加公告弹窗与关于高级招募模拟器的说明弹窗。</p>
        <p>4、增加设置弹窗，同时整合隐藏机制开关和字体加载设置。</p>
        <p>5、优化并增加对新A忍者碎片的光效表现。</p>
        <p>6、增加广告，补贴一点流量成本。</p>`,
    ]
  },
  onLoad: function () {
    
  }
})
